package ua.org.oa.annabezkrovnaya.task4_1;

public @interface _Description {

    /*
    ﻿Задание на Java Collections
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Task 4.1
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Замечания:
    1. Корневой пакет для всех классов: ua.org.oa.<JIRALOGIN>.task4_1
    2. Каждый тип класть в отдельный файл.
    3. Для выполнения задания необходимо ознакомиться с принципами реализации интерфейса Comparable
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Задание:
    ***1.1. Создать класс «автомобиль», в котором определить 2-3 поля.
    ***1.2. Создать класс «компьютер», в котором определить 2-3 поля. Класс компьютер должен реализовывать интерфейс Comparable.
    ***1.3. Создать статический метод, для определения максимального (по compareTo()) значения в массиве объектов.
    Продемонстрировать работу метода на примере массивов типа Integer, String, «автомобиль» (должна быть ошибка компиляции),
    «компьютер».


     */
}
