package ua.org.oa.annabezkrovnaya.practice5;


public @interface _Description {

    /*
    Практическое занятие I/O Stream
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    ***1. Создать и заполнить файл случайными целыми числами.
    ***2. Создать метод который отсортирует содержимое файла из пункта 1 по возрастанию
    ***3. В файле построчно содержится список студентов и их оценки. Вывести на экран фамилии студентов, которые имеют
    средний балл более "90"
    Пример содержимого файла:
    Illia Vinnichenko = 90
    Koliy Lototskiy = 84
    ***4. Прочитать строки из файла и поменять местами первое и последнее слова в каждой строке. (Усложненный вариант –
    поменять местами первое и последнее слово в предложении).
    ***5. Скопировать содержимое одного файла в другой файл с использованием буферизированных и не буферизированных
    потоков. Сравнить время работы.
    *6. Создать класс Student и класс Group содержащий коллекцию студентов.
    Выполнить сериализацию и десериализацию объекта класса Group.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     */
}
