package ua.org.oa.annabezkrovnaya.practice2;


public @interface _Description {
    /*
    Регулярные выражения. Обработка строк.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Задание
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Используя регулярные выражения создать программу для парсинга (синтаксического анализа) текстовой информации из HTML документа.
    Программа должна считывать текст из файла, находить необходимые данные, создавать соответсвующий объект класса описывающего
    структуру данных и добавлять эти объекты в ArrayList. Вывести все значения в консоль.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    1.	Облегченный вариант задания.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Ежегодно на сайте Social Security Online составляют на основании статистических данных рейтинг самых популярных мужских и
    женских имен, которыми родители называют своих детей в США. Данные рейтинга за 2008 год представленны в виде таблицы и
    находятся в файле baby2008.html.
    Необходимо изучить структуру HTML документа и составить регулярное выражение для парсинга данных рейтинга. Создать класс,
    описывающий позицию рейтинга и класс описывающий парсер, в котором будет метод обработки html документа.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    2.	Усложненный вариант задания.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Есть файл с прайс-листом ноутбуков. Изучить структуру HTML документа и составить регулярное выражение для парсинга данных об
    асcортименте продаваемых ноутбуков (название модели, описание, цена и т.п.).Создать класс, описывающий ноутбук и класс для
    парсера, в котором будет метод обработки html документа.
     */
}
