package ua.org.oa.annabezkrovnaya.practice4;


public @interface _Description {
    /*
   Практическое занятие Коллекции
   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   ***1. Напишите класс Student. С полями ИМЯ(firstName), ФАМИЛИЯ (lastName), НОМЕР КУРСА(course)
   ***2. Написать метод static Map<String, Student> createMapFromList(List<Student> students) в классе StudentUtils,
   который из входящего параметра List<Student> students создает Map, где ключ это ИМЯ + ФАМИЛИЯ, а значение объект Student.
   ***3. Напишите метод static void printStudents(List<Student> students, int course) в классе StudentUtils,
   который печатает в консоль имена тех студентов из списка, которые обучаются на данном курсе.
   Для обхода списка в этом методе используйте итератор.
   ***4. Написать метод в классе StudentUtils, который сортирует студентов по имени List<Student> sortStudent(List students).
   ***5. Задан текст на английском языке. Выделить все различные слова. Для каждого слова подсчитать частоту его встречаемости.
   Слова, отличающиеся регистром букв, считать различными. Использовать класс HashMap. Текст считать из файла.
   ***6. Перегрузить метод из пятого задания с возвратом отсортированного Map, по чем сортировать и в каком направлении
   указывать через enum константы.
   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     */
}
