package ua.org.oa.annabezkrovnaya.practice6;

public interface _Description {
    /*
    Практическое занятие Threads
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    ***1.	Создать поток, который бы в течение примерно 5 сек печатал свое имя каждые полсекунды.
    Сделать это двумя способами при помощи расширения класса Thread и при помощи реализации интерфейса Runnable.
    ***2.	Разработайте класс MySchedule, который содержит метод, получающий Map интервалов времени в мсек и согласованных
    с ними сообщений, и выводит соответствующие сообщения на экран через заданные интервалы времени.
    ***3.	Написать программу, которая при помощи нескольких потоков сможет найти все файлы с заданным названием
    (например все txt) в указанной директории и путь к ним записать в лог файл.
    *4.	Реализовать программу которая будет копировать все файлы из одной папки в другую используя потоки
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     */
}
