package ua.org.oa.annabezkrovnaya.practice3;

public @interface _Description {
    /*
    Практическое занятие Generics
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    1. Написать прототип заказа билетов кинотеатра, по условию:
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    а) В системе существует множество пользователей, которые могут заказывать билеты на сеансы.
    б) В системе существует множество кинофильмов, транслируемых в залах во время сеансов.
    в) в каждом зале может быть различная структура мест.
    г) пользователи могут обладать разными правами (админ – управляет кинотеатром, юзер – просматривает расписание
    сеансов и заказывает билеты)
    д) билеты содержат информацию о Кинофильме, сеансе, пользователе, месте.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    2. Создать классы с полями:
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Продумать и создать классы для реализации приведенных выше требований.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    3. Создать прототип базы данных в памяти (in memory)
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Предоставить интерфейс и его реализацию для сущностей из пункта 2, при этом соблюдая все условия спецификации
    пунктов а-д. Данный интерфейс должен содержать все CRUD операции работающие с “in memory data base”. В качестве “in
    memory data base” использовать Generic хранилище данных (GenericStorage<K, V>). Элементы хранить в массиве или List.
    Должно быть реализовано CRUD (create read update delete — «Создание чтение обновление удаление») операций.
     */
}
