package ua.org.oa.annabezkrovnaya.practice1;


public @interface _Description {

    /*
    Unit Testing
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    1. Установка JUnit. Одиночные тесты
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Установите JUnit на локальный компьютер. Проверьте установку JUnit.
    Спроектируйте класс суммирования элементов массива ArraySum, содержащий статический метод sum(),
    принимающий массив в качестве параметра.
    Разработайте класс ArraySumTest для тестирования ArraySum. Реализуйте класс ArraySum.
    Добейтесь корректного выполнения тестов.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    2. JUnit: тесты над общими наборами объектов (fixtures)
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Расширьте класс ArraySum, запланировав в нем конструктор и метод экземпляра sum(), суммирующий массив,
    заданный в конструкторе.
    Расширьте класс ArraySumTest, превратив его в fixture (тест,использующий общий набор объектов).
    В качестве общего объекта должен выступать массив для суммирования.
    Реализуйте дополнительную функциональность в классе ArraySum. Добейтесь корректного выполнения тестов.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    3. JUnit: тестирование исключений
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Добавьте в класс ArraySumTest метод, тестирующий поведение
    класса ArraySum при передаче в его статический метод sum() значения null.
    Оцените результат выполнения теста и добейтесь его корректного
    выполнения.
    Откорректируйте тестирующий метод так, чтобы он ожидал генерации исключения и выдавал ошибку в случае,
    если исключение невозникает. Добейтесь корректного выполнения теста.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    4. JUnit: группы тестов (test suites)
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Добавьте в проект новый класс ArrayProd, реализующий произведение элементов массива и соответствующий тестовый
    класс ArrayProdTest.
    Объедините ArraySumTest и ArrayProdTest в рамках группы тестов AllTests. Выполните группу тестов за один раз.
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    5. Разработка, основанная на тестах
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    Разработайте на основе тестов один из следующих классов.
    Разработать класс, представляющий студента. Студент характеризуется именем, фамилией, группой и набором экзаменов,
    которые он сдавал.
    Экзамен характеризуется названием предмета, оценкой студента по нему и датой сдачи (год, семестр).
    Группа характеризуется курсом и факультетом.
    Необходимые операции таковы:
    узнать наивысшую оценку среди всех экзаменов по данному предмету
    добавить ему оценку по экзамену
    удалить для него оценку по экзамену;
    если он такой экзамен не сдавал - сгенерировать исключение
    узнать число экзаменов, которые он сдал с указанной оценкой
    узнать его средний балл за указанный семестр;
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */

}
